## Plan Result (sbox-global)




<pre><code>Plan: 0 to add, 12 to change, 0 to destroy.</code></pre>

* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;cft-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmcts-access&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hmi-apim&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-user-dashboard&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-admin&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;idam-web-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;labs-louisehuyton-walkthrough&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;labs-zcwalkthrough-nodejs&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;reformscan&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox"
        name                                 = "hmcts-sbox"
      ~ tags                                 = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (67 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["cft-api-mgmt"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cftapimgmtsbox"
        name                              = "cftapimgmtsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmcts-access"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmctsaccesssbox"
        name                              = "hmctsaccesssbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hmi-apim"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hmiapimsbox"
        name                              = "hmiapimsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-user-dashboard"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamuserdashboardsbox"
        name                              = "idamuserdashboardsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-admin"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebadminsbox"
        name                              = "idamwebadminsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["idam-web-public"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/idamwebpublicsbox"
        name                              = "idamwebpublicsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

      ~ managed_rule {
            # (2 unchanged attributes hidden)

          ~ exclusion {
              ~ selector       = "description" -> "scope"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestCookieNames" -> "RequestBodyPostArgNames"
              ~ selector       = "_ga" -> "description"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "_gat" -> "_ga"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "_gid" -> "_gat"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "dtSa" -> "_gid"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "dtCookie" -> "dtSa"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "dtLatC" -> "dtCookie"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "dtPC" -> "dtLatC"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "rxVisitor" -> "dtPC"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "rxvt" -> "rxVisitor"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "cookies_policy" -> "rxvt"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "cookies_preferences_set" -> "cookies_policy"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "seen_cookie_message" -> "cookies_preferences_set"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "Idam.AuthId" -> "seen_cookie_message"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "Idam.Session" -> "Idam.AuthId"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestCookieNames"
              ~ selector       = "iss" -> "Idam.Session"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "jwt" -> "iss"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestBodyPostArgNames" -> "QueryStringArgNames"
              ~ selector       = "label" -> "jwt"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "oauth2ClientSecret" -> "label"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ operator       = "StartsWith" -> "Equals"
              ~ selector       = "password" -> "oauth2ClientSecret"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "username" -> "password"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "email" -> "username"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestBodyPostArgNames"
              ~ operator       = "Equals" -> "StartsWith"
              ~ selector       = "redirect_uri" -> "email"
            }
          ~ exclusion {
              ~ match_variable = "RequestBodyPostArgNames" -> "QueryStringArgNames"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestBodyPostArgNames"
              ~ selector       = "redirectUri" -> "redirect_uri"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestBodyPostArgNames" -> "QueryStringArgNames"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestBodyPostArgNames"
              ~ selector       = "referer" -> "redirectUri"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "refresh_token" -> "referer"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestBodyPostArgNames" -> "QueryStringArgNames"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestBodyPostArgNames"
              ~ selector       = "response_type" -> "refresh_token"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "scope" -> "response_type"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "state" -> "scope"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestBodyPostArgNames" -> "QueryStringArgNames"
              ~ selector       = "token" -> "state"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestBodyPostArgNames"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "RequestCookieNames" -> "QueryStringArgNames"
              ~ selector       = "Idam.SSOSession" -> "token"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestCookieNames"
              ~ selector       = "session_state" -> "Idam.SSOSession"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "code" -> "session_state"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "nonce" -> "code"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "post_logout_redirect_uri" -> "nonce"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "id_token_hint" -> "post_logout_redirect_uri"
                # (2 unchanged attributes hidden)
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "id_token_hint"
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["labs-louisehuyton-walkthrough"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labslouisehuytonwalkthroughsbox"
        name                              = "labslouisehuytonwalkthroughsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["labs-zcwalkthrough-nodejs"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/labszcwalkthroughnodejssbox"
        name                              = "labszcwalkthroughnodejssbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["plum"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/plumsbox"
        name                              = "plumsbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["reformscan"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/reformscansbox"
        name                              = "reformscansbox"
      ~ tags                              = {
          ~ "environment"  = "Sandbox" -> "sandbox"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoors/hmcts-sbox|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 12 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1428,"Program":"tfcmt","SHA1":"","Target":"sbox-global","Vars":{}} -->